{
    "HOME": "Home",
    "LOGIN": "Login",
    "HIGHSCORES": "Highscores",
    "CREATE GAME": "Create game",
    "GAME": "Game",
    "USERNAME": "Username",
    "USERNAME IS REQUIRED": "Username is required",
    "PASSWORD": "Password",
    "PASSWORD IS REQUIRED": "Password is required",
    "PASSWORD 6 CHAR": "Password must be at least 6 characters",
    "LOGIN FAILED": "Login failed",
    "NO ACCOUNT": "Don't have an account?",
    "SIGN UP": "Sign up" ,
    "RANDOM": "Randomize fleet",
    "NAME": "Your name",
    "EMAIL": "E-mail",
    "NAME IS REQUIRED": "Name is required",
    "EMAIL IS REQUIRED": "E-mail is required",
    "EMAIL MUST BE VALID": "E-mail must be valid",
    "REGISTER": "Register",
    "SIGNUP FAILED": "Sign up is failed :",
    "REGISTRATION SUCCESS": "Your registration is successful. Please login!",
    "GAME NAME": "Game name",
    "AM I STARTING": "Am I Starting?",
    "YES": "Yes",
    "NO": "No",
    "GAME TYPE": "Game Type",
    "STANDARD": "Standard",
    "START GAME": "Start Game",
    "DIMENSION": "Dimension",
    "GAME MODE": "Game mode",
    "GAME STATE": "Game state",
    "IN_PROGRESS": "In progress",
    "IN_PREPARATION": "In preparation",
    "WAITING": "Waiting",
    "FINISHED": "Finished",
    "JOIN GAME": "Join game",
    "NICK": "Nick",
    "GAMES PLAYED": "Games played",
    "GAMES WON": "Games won",
    "RATIO": "Winning ratio",
    "WAITING_FOR_PLAYER": "Waiting for opponent",    
    "LOST": "You lose!",
    "WON": "You won!",
    "NOT YOUR TURN": "Wait! its not your turn!",
    "YOUR TURN": "Your turn",
    "HIT": "You hit the ship!",
    "MISSED": "Ehhh... You Missed!",
    "PERMISION DIENED": "Permission denied",
    "MY BOARD": "My Board",
    "OPPONENT BOARD": "Opponent's Board",
    "ENDGAME": "Game has ended",
    "READY": "Ready",
    "LOGOUT": "Logout",
    "HOW TO PLAY": "How to play",
    "RESULT": "Result",
    "USER": "User",
    "SHOTS": "Shots",
    "HITS": "Hits",
    "WIN_RATIO": "Shooting ratio",
    "HELP": "Help",
    "CAPITULATE": "Capitulate",
    "LOGIN AND REGISTER HEADER": "Signing up & Signing in",
    "LOGIN AND REGISTER BODY":"In order to play the game one needs to be created. We can either join game created by another user or make our own. But before such actions are made we need to be signed in. Making an account is fairly simple, head over to the Register section on the navigation bar at the top of site. Once in there will be register form waiting to be filled. If that was done properly, check in “I agree to terms and conditions” box, then click “Register” button. If everything was filled correctly you will be redirected to login form. Signing in will move us back to homepage, where all currently running games are listed",
    "HOMEPAGE HEADER": "Homepage",
    "HOMEPAGE BODY":"Now you have access to “Create game” bar, also you are able to join any game that is in “Waiting for player” state. Each game will be in one of four states which are as follows:Waiting for opponent - means that game is waiting for another player to join in. In progress - means that game already has 2 players, who already started to play. Finished - means that players are finished playing and are now looking at game summary screen.",
    "SETTING UP HEADER": "Setting up our own game",
    "SETTING UP BODY": "Creating our own game is pretty simple. Click “Create game” bar and fill up game form. It will define game name, rules and starting player. After you do so “create game” bar will appear. Click on it in order to move to ship placement section. Once there you will see your board and “Randomize fleet” button. At this point game is already created with a “Waiting for opponent” state and other players can join it anytime. Now it’s time for placing your ships on the board. When second player joins the game he will be placing his own fleet. After you are done, click “Ready” button. If clicked by both players the game will start automatically. To continue from now on head over to the “Game rules & How to play” section.",
    "RULES MANUAL": "Rules Manual",
    "RULES MANUAL BODY": "Battleships” is a guessing, turn-based game for 2 players. It is played on square boards divided by grid, the goal is to shoot down enemy fleet before he does so with ours. The very essence of the game is fact that position of enemy ships is concealed, so in order to win good guesses and sometimes bit of luck will be needed.",
    "BASIC GAME COMPONENT HEADER" : "Basic game components",
    "BASIC GAME COMPONENT BODY": "Main game components are two identical boards with given dimensions which are corresponding to second player’s boards. Most of gameplay will take place on those. Left board contains our fleet, while right - opponent’s fleet. Rows on boards are described by capital letters, while each column has its own unique number. Board with our fleet (leftone) is not interactive and serves mainly as information about opponent’s actions. Our moves will be marked on board signed as “Opponent’s board”. To fire at chosen field hover cursor over it and click left mouse button (or tap it while playing on touch-interface device).Right below boards there’s a text window holding live transcript of the game. Every move made will be displayed along with date, player who made it and it’s outcome.",
    "FLEET HEADER" : "Fleet",
    "FLEET BODY" : "Both players have exactly the same fleet. Standard one consists of 10 ships: 1 ship with length of 4 fields,  2 ships with length of 3 fields,  3 ships with length of 2 fields, 4 ships with length of 1 fieldEach of ships is a rectangle with dimensions “1 field” times length of the ship.",
    "SHOOT OUTCOME HEADER": "Shoot outcome",
    "SHOOT OUTCOME BODY": "Depending on shoot outcome fields will change its state and colour. Red means that shoot has missed the target and there’s no enemy ship on given field. Green means enemy ship has been hit. Each ship from our fleet placed on the left board is marked with grey colour. X symbol on such ship means, that it was hit by the enemy",
    "FLEET PLACEMENT HEADER": "Fleet placement",
    "FLEET PLACEMENT BODY": "Before the actual games begins, each player randoms placement of his fleet on board. According to rules of placing the ships they can’t “touch” each other, which is worthy remembering throughout the game. Randomizing can be repeated until output is satisfying. When we are ready and fleet is placed on board click “Ready” button. Then we need to wait for our opponent to do the same. If both players are done and ready, game will be started automatically.",
    "GAME PLAY HEADER": "Gameplay",
    "GAME PLAY BODY": "Game is turn-base. Information about who has a turn currently is displayed in the middle of screen just above boards. While player has a turn he fires at chosen field. If shoot missed turns are switched and it’s time for our opponent to make his move. If shoot indeed hit a ship, then player receives another turn, he will continue to do so until he misses. Then again turn will be handled to the first player. This means that it is possible for a player that starts to sink whole enemy fleet without handling turn to his opponent (if one is lucky enough). Ship which is hit but still has remaining non-hit fields is treated as hit-but-not-sunken. One that has its all fields hit is treated as hit-and-sunken, which means that according to previous mentioned rules there are no ships on neighbour fields. Game will detect sunken ships and will mark all neighbouring fields with red colour. Shooting at field marked as red will handle turn to the opponent, but shooting at already hit or sunken ship will not. Once a player sunk all ships of enemy’s fleet he wins, and the game ends. Then both players are shown game summary containing game data and players statistics.",
    "GREETING": "Developers team WKBP wishes you a pleasant gaming experience.",
    "REGULATIONS": "By registering, you consent to the processing of personal data for marketing and administrative purposes.",
    "WAITING FOR OPPONENT": "Waiting for opponent"
}