{
    "HOME": "Strona Domowa",
    "LOGIN": "Logowanie",
    "HIGHSCORES": "Galeria Sław",
    "GAME": "Gra",
    "CREATE GAME": "Stwórz grę",
    "USERNAME": "Użytkownik",
    "USERNAME IS REQUIRED": "Użytkownik jest wymagany",
    "PASSWORD": "Hasło",
    "PASSWORD IS REQUIRED": "Hasło jest wymagane",
    "PASSWORD 6 CHAR": "Hasło musi mieć 6 znaków",
    "LOGIN FAILED": "Logowanie nieudane",
    "NO ACCOUNT": "Nie masz konta?",
    "SIGN UP": "Zarejestruj się",
    "RANDOM": "Losuj rozstawienie floty",
    "NAME": "Twoje imie",
    "EMAIL": "E-mail",
    "NAME IS REQUIRED": "Imie jest wymagane",
    "EMAIL IS REQUIRED": "E-mail jest wymagany",
    "EMAIL MUST BE VALID": "E-mail jest niewłaściwy",
    "REGISTER": "Zarejestruj",
    "SIGNUP FAILED": "Rejestracja nie powiodła się :",
    "REGISTRATION SUCCESS": "Rejestracja przebiegła pomyślnie. Zaloguj się!",
    "GAME NAME": "Nazwa gry",
    "AM I STARTING": "Czy zaczynam?",
    "YES": "Tak",
    "NO": "Nie",
    "GAME TYPE": "Tryb gry",
    "STANDARD": "Standard",
    "START GAME": "Wejdź do gry",
    "DIMENSION": "Wymiary",
    "GAME MODE": "Tryb gry",
    "GAME STATE": "Stan gry",
    "IN_PROGRESS": "W trakcie",
    "IN_PREPARATION": "Podczas konfiguracji",
    "WAITING": "Oczekująca",
    "FINISHED": "Zakończona",
    "JOIN GAME": "Dołącz",
    "NICK": "Nick",
    "GAMES PLAYED": "Rozegrane gry",
    "GAMES WON": "Wygrane gry",
    "RATIO": "Procent wygranych",
    "WAITING_FOR_PLAYER": "Oczekiwanie na przeciwnika",
    "LOST": "Przegrałeś!",
    "WON": "Wygrałeś!",
    "NOT YOUR TURN": "Czekaj! To nie Twoja tura!",
    "YOUR TURN": "Twoja tura",
    "HIT": "Trafiłeś statek!",
    "MISSED": "Ehhh... Pudło!",
    "PERMISION DIENED": "Brak uprawnień",
    "MY BOARD": "Moja plansza",
    "OPPONENT BOARD": "Plansza przeciwnika",
    "ENDGAME": "Gra się zakończyła",
    "READY": "Gotowy",
    "LOGOUT": "Wyloguj",
    "HOW TO PLAY": "Jak grać?",
    "RESULT": "Wynik",
    "USER": "Gracz",
    "SHOTS": "Strzały",
    "HITS": "Trafione",
    "RATIOL": "Skuteczność strzałów",
    "HELP": "Pomoc",
    "CAPITULATE": "Poddaj się",
    "LOGIN AND REGISTER HEADER": "Logowanie i Rejestracja",
    "LOGIN AND REGISTER BODY": "Aby założyć nową grę należy utworzyć konto i zalogować się nie. Niezalogowani użytkownicy nie mogą tworzyć własnych gier ani uczestniczyć w grach stworzonych przez inne osoby. Zarejestrować możemy się klikając na zakładkę “Rejestracja”, zostaniemy wtedy przekierowani do formularza rejestracyjnego. Po prawidłowym wypełnieniu należy zaznaczyć pole “Akceptuję regulamin” i kliknąć “Zarejestruj”. Po udanym procesie rejestracji zostaniemy przekierowani do formularza logowania. Wypełniamy wymagane pola zgodnie z zarejestrowanymi wcześniej danymi. Gdy zalogowanie przebiegnie pomyślnie naszym oczom ukaże się strona główna.",
    "HOMEPAGE HEADER": "Strona Główna",
    "HOMEPAGE BODY": "Znajdziemy tutaj listę wszystkich gier, które są obecnie rozgrywane. Gra może mieć 4 różne stany, a są to kolejno:Czekam na przeciwnika - oznacza to, że do gry można dołączyć. W trakcie - oznacza, że w pokoju gry znajduje się obecnie 2 graczy, a rozgrywka pomiędzy nimi trwa. Zakończona - oznacza, że rozgrywka została rozegrana, a gracze oglądają podsumowanie i wynik gry.",
    "SETTING UP HEADER": "Tworzenie własnej gry",
    "SETTING UP BODY": "Po wypełnieniu wymaganych pól pojawi się przycisk “Stwórz grę”. Naszym oczom ukaże się wtedy widok naszej planszy oraz przycisk “Losuj rozstawienie floty”.W tym momencie nasza gra jest już utworzona i zarejestrowani użytkownicy mogą już do niej dołączać. Klikając na przycisk otrzymamy za każdym razem losowy układ statków na planszy. Gry statki są w zadowalającym nas ułożeniu klikamy przycisk “Gotowy”. Nasz przeciwnik jeśli dołączył do gry może rozstawiać swoje statki równolegle. Po kliknięciu “Gotowy” nasz ekran pokaże nam ekran oczekiwania na przeciwnika lub jeśli obaj gracze są gotowi - ekran rozgrywki. Dalsze informacje znajdują się w sekcji: Zasady gry i jak grać.",
    "RULES MANUAL": "Zasady gry",
    "RULES MANUAL BODY": "Statki to dwuosobowa, turowa gra polegająca na odgadywaniu. Rozgrywka odbywa się na kwadratowych planszach podzielonych siatką na pola, a jej celem jest zestrzelenie statków przeciwnika zanim on zrobi to z naszymi. Sedno gry to ukryte rozstawienie floty gracza przeciwnego, więc aby wygrać konieczne będzie typowanie dobrych pól do oddania strzału.",
    "BASIC GAME COMPONENT HEADER" : "Podstawowe komponenty rozgrywki",
    "BASIC GAME COMPONENT BODY" : "Głównym komponentem i miejscem, gdzie toczy się gra to 2 plansze o danych wymiarach. Są one identyczne pod względem wielkości i zawierają odpowiednio: lewa - naszą flotę oraz prawa - przeciwnika. Każda z nich jest również opisana numerami kolumn oraz literami odpowiadającymi rzędom. Plansza z naszą flotą nie jest interaktywna i służy tylko jako informacja o akcjach gracza przeciwnego. Nasze ruchy będziemy zaznaczać po prawej stronie. Aby wykonać strzał należy najechać kursorem myszki na wybrane pole i nacisnąć lewy przycisk myszki. Pod planszami znajduję się okno tekstowe, które będzie opisywać na bieżąco przebieg rozgrywki, znajdzie się tam każdy ruch oraz jego wynik." ,
    "FLEET HEADER" : "Flota",
    "FLEET BODY" : "Oboje gracze mają do dyspozycji dokładnie taką samą flotę. Podstawowa składa się z 10 statków: 1 statek o długości 4 pól, 2 statki o długości 3 pól, 3 statki o długości 2 pól,  4 statki o długości 1 pola. Każdy statek jest prostokątem o wymiarach 1 pole x długość statku.",
    "SHOOT OUTCOME HEADER": "Wynik strzału",
    "SHOOT OUTCOME BODY": "W zależności od wyniku strzału pole zmieni kolor. Czerwony oznacza, że strzał chybił i nie ukrywa się pod nim żaden statek wroga. Kolor zielony oznacza trafienie statku. Każdy statek z naszej floty rozstawiony na lewej planszy jest zaznaczony szarym kolorem. Symbol X na takim statku oznacza, że został on trafiony.",
    "FLEET PLACEMENT HEADER": "Rozstawianie floty",
    "FLEET PLACEMENT BODY": "Na początku gry każdy z graczy losuje rozstawienie floty na swojej planszy. Zgodnie z zasadami ustawiania statki nie mogą się “dotykać”, o czym warto pamiętać również podczas samej gry! Losowanie to można powtarzać dopóki układ statków nie będzie nas satysfakcjonował. Gdy już to nastąpi klikamy przycisk “Gotowy”. Następuje wtedy oczekiwanie na rozstawienie floty przez gracza przeciwnego. Jeśli obaj gracze są gotowi rozgrywka zacznie się automatycznie.",
    "GAME PLAY HEADER": "Przebieg rozgrywki",
    "GAME PLAY BODY": "Gra jest turowa, a o tym czyja tura jest obecnie informować będzie nas napis na środku ekranu rozgrywki. Gracz, który posiada swoją turę oddaje strzał w wybrane pole. Jeśli strzał chybił następuje zmiana tury - otrzymuje ją nasz oponent. Jeśli strzał trafił statek przeciwnika gracz otrzymuje kolejny ruch, będzie się tak działa dopóki strzał nie chybi. Wtedy znowu nastąpi zmiana tury. Z tego względu możliwe jest zatopienie całej floty przeciwnika nie oddając mu tury (co będzie bardzo trudne!). Statek, który zostanie trafiony ale dalej będzie miał nietrafione pola jest traktowany jako trafiony-niezatopiony. Statek, którego wszystkie pola zostały trafione jest trafiony-zatopiony oznacza to również, że zgodnie ze wspomnianymi wcześniej zasadami rozstawiania na wszystkich polach wokół nie znajduje się żaden inny statek. Gra wykryje automatycznie taką sytuację i zaznaczy wszystkie pola wokół na czerwono. Jeśli oddamy strzał w czerwone pole tura będzie przekazana do przeciwnika, zaś jeśli strzelimy w już trafione pole statku dalej będziemy mieli turę. W momencie, w którym jeden z graczy zestrzelił całą flotę przeciwnika wygrywa, a gra kończy się. Po każdej z gry dostępne jest podsumowanie zawierające dane o grze i statystyki graczy. ",
    "GREETING": "Zespół deweloperski WKBP życzy miłej gry."
}